#1111111111111
#2222222222222 произвольное содержимое

Создайте файл .gitignore (обратите внимание на точку в начале файла)
и проверьте его статус сразу после создания.
Добавьте файл .gitignore в следующий коммит git add....
Напишите правила в этом файле, чтобы игнорировать любые файлы .pyc,
а также все файлы в директории cache.

Git (произносится «гит»[7]) — распределённая система управления версиями.
Проект был создан Линусом Торвальдсом для управления разработкой ядра Linux,
первая версия выпущена 7 апреля 2005 года.
На сегодняшний день его поддерживает Джунио Хамано.

Среди проектов, использующих Git, — ядро Linux, Swift, Android,
Drupal, Cairo, GNU Core Utilities, Mesa, Wine, Chromium,
Compiz Fusion, FlightGear, jQuery, PHP, NASM, MediaWiki,
DokuWiki, Qt, ряд дистрибутивов Linux.
